app/views/teams/index.html.erb

SELECT  1 AS one FROM "students" WHERE "students"."team_id" = ? LIMIT ?  [["team_id", "1"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."team_id" = ?  [["team_id", "3"]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 3]]
---
<% @teams.each do |team| %>
	<% if team.students.empty? %>
		<% team.destroy %>

SELECT "tools".* FROM "tools" WHERE "tools"."team_id" = ?  [["team_id", 3]]
SELECT COUNT(*) FROM "tools" WHERE "tools"."team_id" = ?  [["team_id", 1]]
---
        <td><%= team.description %></td>
        <td><%#= team.tools.count %></td>