app/views/teams/show.html.erb

<h3>Tools</h3>
<% if !@team.tools.empty? %>
---
SELECT  1 AS one FROM "tools" WHERE "tools"."team_id" = ? LIMIT ?  [["team_id", 1], ["LIMIT", 1]]
SELECT "tools".* FROM "tools" WHERE "tools"."team_id" = ?  [["team_id", 1]]

<h3>Students</h3>
<% if !@team.students.empty? %>
---
SELECT  1 AS one FROM "students" WHERE "students"."team_id" = ? LIMIT ?  [["team_id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."team_id" = ?  [["team_id", "1"]]