app/views/students/_loans.html.erb

    <% loans.each do |loan| %>
    <% @tool = Tool.find(loan.tool_id) %>
---
SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

        <!--<td><%= loan.returned %></td>-->
        <% @borrower=Student.find(loan.borrower_id) %>
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]