app/views/students/new.html.erb

<% if session[:created_team] %>
<% @team=Team.find(session[:team])%>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]