app/views/loans/show.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  <strong>Borrower:</strong>
  <%= Student.find(@loan.borrower_id).name %>