app/controllers/loans_controller.rb

  def create
    @loan = @tool.loans.new(create_loan_params)
    @tool.update(:quantity => @tool.quantity - @loan.tool_quantity)
    @loan.borrower_id = session[:student_id]
    @loan.accepted = false

    respond_to do |format|
      if @loan.save
---
INSERT INTO "loans" ("borrower_id", "tool_quantity", "start", "end", "created_at", "updated_at", "tool_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["borrower_id", 1], ["tool_quantity", 1], ["start", "2019-12-04"], ["end", "2019-12-05"], ["created_at", "2019-12-04 12:49:16.870450"], ["updated_at", "2019-12-04 12:49:16.870450"], ["tool_id", 3]]

  def update
    respond_to do |format|
      if @loan.update(update_loan_params)
        if @loan.returned
          @tool.update(:quantity => @tool.quantity + @loan.tool_quantity)
        end
        if @loan.borrower_id = session[:student_id]
          format.html { redirect_to Student.find(@loan.borrower_id), notice: 'Loan was successfully updated.' }
---
UPDATE "loans" SET "accepted" = ?, "owner_id" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["accepted", "t"], ["owner_id", 3], ["updated_at", "2019-12-04 12:49:54.776425"], ["id", 1]]
UPDATE "tools" SET "quantity" = ?, "updated_at" = ? WHERE "tools"."id" = ?  [["quantity", 2], ["updated_at", "2019-12-04 12:54:12.850405"], ["id", 3]]
SELECT  "loans".* FROM "loans" WHERE "loans"."tool_id" = ? AND "loans"."id" = ? LIMIT ?  [["tool_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def set_loan
      @loan = @tool.loans.find(params[:id])
---
SELECT  "loans".* FROM "loans" WHERE "loans"."tool_id" = ? AND "loans"."id" = ? LIMIT ?  [["tool_id", 3], ["id", 1], ["LIMIT", 1]]