app/controllers/students_controller.rb

  def index
    @students = Student.search(params[:search])
    @current_student = Student.find(session[:student_id])
---
SELECT "students".* FROM "students"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    @team_loans = Team.find(@student.team_id).loans
    @pending_loans = @team_loans.where(accepted: false)
    @student_asked_loans = Loan.where(borrower_id: @student.id)
    @student_approved_loans = Loan.where(owner_id: @student.id).where(returned: nil)
    @finished_loans = @team_loans.where.not(returned: nil)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "loans".* FROM "loans" INNER JOIN "tools" ON "loans"."tool_id" = "tools"."id" WHERE "tools"."team_id" = ? AND "loans"."accepted" = ?  [["team_id", 4], ["accepted", "f"]]
SELECT "loans".* FROM "loans" WHERE "loans"."borrower_id" = ?  [["borrower_id", 7]]
SELECT "loans".* FROM "loans" WHERE "loans"."owner_id" = ? AND "loans"."returned" IS NULL  [["owner_id", 7]]
SELECT "loans".* FROM "loans" INNER JOIN "tools" ON "loans"."tool_id" = "tools"."id" WHERE "tools"."team_id" = ? AND ("loans"."returned" IS NOT NULL)  [["team_id", 1]]

  def create

    @student = Student.new(student_params)

    if session[:created_team]
      @student.team_id = session[:team]
      @student.admin = true
      session[:admin_pendente] = false
      @student.team_password = Team.find(@student.team_id).password
    end

    if @student.team_password == Team.find(@student.team_id).password
      respond_to do |format|
        if @student.save
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "students" ("given_name", "family_name", "email", "created_at", "updated_at", "password_digest", "photo", "admin", "team_password", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]