app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE (name like '%a%')
SELECT  1 AS one FROM "students" WHERE "students"."team_id" = ? LIMIT ?  [["team_id", "1"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."team_id" = ?  [["team_id", "3"]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 3]]
---
  def index

    Team.all.each do |team|
    	if team.students.empty?
    	  team.destroy

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @student= Student.find(session[:student_id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @student = Student.find(session[:student_id])

INSERT INTO "teams" ("id", "name", "description", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?, ?)  [["id", 9], ["name", "ççç"], ["description", ""], ["created_at", "2019-12-04 15:58:43.903643"], ["updated_at", "2019-12-04 15:58:43.903643"], ["password", "ççç"]]
SELECT  "students".* FROM "students" WHERE "students"."team_id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["team_id", 17], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
        session[:student_id] = @team.students.first.id

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    respond_to do |format|
      if @team.update(team_params)
        @student = Student.find(session[:student_id])

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 6]]
---
  def destroy
    @team.destroy

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:id])