app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools" WHERE (name like '%g%')
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def index
    @tools = Tool.search(params[:search])
    @student = Student.find(session[:student_id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @student=Student.find(session[:student_id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tools" ("name", "description", "quantity", "photo", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Furadeira"], ["description", "a"], ["quantity", 3], ["photo", "1301152.jpg"], ["team_id", 1], ["created_at", "2019-12-03 13:26:48.332454"], ["updated_at", "2019-12-03 13:26:48.332454"]]
---
  def create

    @tool = Tool.new(tool_params)
    @student = Student.find(session[:student_id])
    @tool.team_id= @student.team_id

    respond_to do |format|
      if @tool.save

UPDATE "tools" SET "name" = ?, "photo" = ?, "updated_at" = ? WHERE "tools"."id" = ?  [["name", "Politriz"], ["photo", "C1.JPG"], ["updated_at", "2019-12-04 17:20:43.496545"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @tool.update(tool_params)

SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_tool
      @tool = Tool.find(params[:id])