app/controllers/welcome_controller.rb

    def home
        @student=Student.find(session[:student_id])
        @team_loans = Team.find(@student.team_id).loans
        @pending_loans = @team_loans.where(accepted: false)
        @student_asked_loans = Loan.where(borrower_id: @student.id)
        @student_approved_loans = Loan.where(owner_id: @student.id).where(returned: nil)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "loans".* FROM "loans" INNER JOIN "tools" ON "loans"."tool_id" = "tools"."id" WHERE "tools"."team_id" = ? AND "loans"."accepted" = ?  [["team_id", 2], ["accepted", "f"]]
SELECT "loans".* FROM "loans" WHERE "loans"."borrower_id" = ?  [["borrower_id", 3]]
SELECT "loans".* FROM "loans" WHERE "loans"."owner_id" = ? AND "loans"."returned" IS NULL  [["owner_id", 3]]